Revit 2026 API

# PartUtilsFindMergeableClusters Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<ICollection<ElementId>> FindMergeableClusters(
	Document doc,
	ICollection<ElementId> partIds
)
```
```vb
Public Shared Function FindMergeableClusters (
	doc As Document,
	partIds As ICollection(Of ElementId)
) As IList(Of ICollection(Of ElementId))
```
```cpp
public:
static IList<ICollection<ElementId^>^>^ FindMergeableClusters(
	Document^ doc,
	ICollection<ElementId^>^ partIds
)
```
```fsharp
static member FindMergeableClusters :
        doc : Document *
        partIds : ICollection<ElementId> -> IList<ICollection<ElementId>>
```

#### Parameters

doc Document

partIds ICollectionElementId

#### Return Value

IListICollectionElementId

#### Reference

PartUtils Class

Autodesk.Revit.DB Namespace